app/Http/Helpers/helpers.php

select * from `languages` where `status` = 1 limit 1
---
function selectedLang(){
    $default_language = Language::where('status',GlobalConst::ACTIVE)->first();

select * from `languages` where `status` = 1 limit 1
---
function selectedLangDir(){
    if(session()->get('local')){
    $default_language = Language::where('code',session()->get('local'))->first();
    $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    }else{
        $default_language = Language::where('status',GlobalConst::ACTIVE)->first();

select * from `virtual_card_apis` limit 1
---
function virtual_card_system($name)
{
    $method = VirtualCardApi::first();

select count(*) as aggregate from `strowallet_virtual_cards`
select count(*) as aggregate from `strowallet_virtual_cards` where `is_active` = 0
---
 function activeCardData(){
    if(virtual_card_system('flutterwave') == "flutterwave"){
        $virtual_cards = VirtualCard::toBase()->count();
        $active_cards =  VirtualCard::toBase()->where('is_active',1)->count();
        $inactive_cards = VirtualCard::toBase()->where('is_active',0)->count();
    }elseif(virtual_card_system('sudo') == "sudo"){
        $virtual_cards = SudoVirtualCard::toBase()->count();
        $active_cards =  SudoVirtualCard::toBase()->where('status',1)->count();
        $inactive_cards = SudoVirtualCard::toBase()->where('status',0)->count();
    }elseif(virtual_card_system('stripe') == "stripe"){
        $virtual_cards = StripeVirtualCard::toBase()->count();
        $active_cards =  StripeVirtualCard::toBase()->where('status',1)->count();
        $inactive_cards = StripeVirtualCard::toBase()->where('status',0)->count();
    }elseif(virtual_card_system('strowallet') == "strowallet"){
        $virtual_cards = StrowalletVirtualCard::toBase()->count();
        $active_cards =  StrowalletVirtualCard::toBase()->where('is_active',1)->count();