app/Http/Controllers/SiteController.php

select * from `basic_settings` limit 1
select * from `app_settings` limit 1
---
    public function home(){
        $basic_settings = BasicSettings::first();
        $page_title = $basic_settings->site_title??"Home";
        $app_urls = AppSettings::first();